{
  "Technical Risk": {
    "category": "Technology",
    "description": "Uncertainty whether the technology will perform, scale, or maintain quality in real-world conditions.",
    "indicators": [
      "Low TRL or incomplete prototype",
      "Limited or non-independent performance data",
      "Integration with existing systems untested or complex"
    ],
    "mitigation": [
      "Plan structured pilots, verification tests, and stress tests.",
      "Engage accredited independent testing partners (labs, universities).",
      "Introduce formal QA/QC gates and reliability checkpoints at each milestone.",
      "Prototype alternative architectures to reduce technical dependencies."
    ],
    "severity": "High"
  },

  "Market Adoption Risk": {
    "category": "Market & Customers",
    "description": "Customers may not adopt quickly due to awareness, poor fit, or behaviour change barriers.",
    "indicators": [
      "Few or no reference customers",
      "Long customer education or onboarding required",
      "Value proposition not yet proven in real settings"
    ],
    "mitigation": [
      "Run small-scale paid pilots with tightly scoped success metrics.",
      "Collect testimonials, case studies, and usage insights early.",
      "Refine messaging, onboarding flow, and user journey.",
      "Offer low-friction adoption such as trials, guarantees, or modular entry points."
    ],
    "severity": "Medium"
  },

  "Funding / Liquidity Risk": {
    "category": "Finance",
    "description": "Insufficient capital or unstable cash flow may limit ability to scale or complete milestones.",
    "indicators": [
      "High CAPEX or long ROI period",
      "Dependence on single investor, grant, or donor",
      "Weak financial controls or irregular revenue"
    ],
    "mitigation": [
      "Diversify funding sources (grants, equity, revenue-based financing, carbon credits).",
      "Structure phased milestones to unlock investor tranches with reduced dilution.",
      "Adopt lean operations and validate early revenue channels.",
      "Model 12–24 month cash runway and perform sensitivity checks."
    ],
    "severity": "High"
  },

  "IP / Legal Risk": {
    "category": "Legal & Intellectual Property",
    "description": "Insufficient IP protection, ownership ambiguity, or regulatory exposure.",
    "indicators": [
      "No provisional, design, or trademark filings yet",
      "IP ownership unclear across co-developers or partners",
      "Industry requires certification or compliance not yet obtained"
    ],
    "mitigation": [
      "File a provisional patent or design registration early.",
      "Use an IP attorney for licensing, assignments, or co-development contracts.",
      "Conduct an FTO (Freedom to Operate) scan using WIPO, CIPC, or commercial tools.",
      "Map required certifications and compliance pathways early."
    ],
    "severity": "Medium"
  },

  "Partnership Risk": {
    "category": "Partnerships & Ecosystem",
    "description": "Over-reliance on or misalignment with critical partners and stakeholders.",
    "indicators": [
      "Single distribution or manufacturing partner dependency",
      "Unclear roles, responsibilities, or deliverables",
      "Verbal-only agreements or expired MoUs"
    ],
    "mitigation": [
      "Diversify key partners where possible (suppliers, distributors, validators).",
      "Replace verbal expectations with written MoUs + SLAs.",
      "Define IP ownership, revenue share, and exit clauses in advance.",
      "Start small with scoped pilot agreements before long-term commitments."
    ],
    "severity": "Medium"
  },

  "Operational Risk": {
    "category": "Operations & Delivery",
    "description": "Internal processes, supply chains, or resources are not mature enough to deliver consistently.",
    "indicators": [
      "Immature SOPs and QA/QC processes",
      "Single-point supplier dependencies",
      "Lack of production or delivery redundancy"
    ],
    "mitigation": [
      "Map supply chain and identify single points of failure.",
      "Introduce SOPs, dashboards, and rapid-response systems.",
      "Build redundancy into suppliers, logistics, and QA checkpoints.",
      "Run small-scale operational pilots to validate throughput."
    ],
    "severity": "Medium"
  },

  "ESG / Sustainability Risk": {
    "category": "ESG & Compliance",
    "description": "Environmental, social, or governance shortcomings may limit regulatory approval, investment, or trust.",
    "indicators": [
      "Unclear ESG metrics or disclosures",
      "High environmental impact or community risk",
      "Potential misalignment with national or global sustainability frameworks"
    ],
    "mitigation": [
      "Quantify ESG impacts (CO₂, waste, jobs, inclusion, governance).",
      "Align with SDGs, national policy, carbon tax, and sectoral guidelines.",
      "Introduce transparent ESG reporting, monitoring, and stakeholder engagement.",
      "Highlight positive climate and social impacts in investment materials."
    ],
    "severity": "Medium"
  }
}
